stressTesting.yml
config:
  target: 'https://localhost:3004'
  phases:
    - duration: 10
      arrivalRate: 5
      name: "Warm-up"
    - duration: 20
      arrivalRate: 10
      rampTo: 20
      name: "Traffic Spike"
    # - duration: 120
    #   arrivalRate: 50
    #   name: "Final"
  processor: "./scenarios.js"
scenarios:
  - name: "Search and mark helpful"
    flow:
      

    # flow:
    #   # - get:
    #   #     url: "/"
    #   # call getProductId() to create id variable
    #   - function: "getProductId"
    #   - get:
    #       url: "/reviews/{{ product_id }}/list"
    #   # - function: "getReviewId"
    #   # - post:
    #   #     url: "/reviews/helpful/{{ review_id }}"